Revit 2024 API
DistributionSysType Class
Represents a specific type of distribution system.
Namespace: Autodesk.Revit.DB.Electrical
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Syntax
C#
public class DistributionSysType : ElementType
Visual Basic
Public Class DistributionSysType _
	Inherits ElementType
Visual C++
public ref class DistributionSysType : public ElementType
Inheritance Hierarchy
System.Object
 Autodesk.Revit.DB.Element
 Autodesk.Revit.DB.ElementType
 Autodesk.Revit.DB.Electrical.DistributionSysType
See Also
DistributionSysType Members
Autodesk.Revit.DB.Electrical Namespace